Kolodieiev/MeowUI/lib/TFT_eSPI/Processors/TFT_eSPI_ESP32_S3.cpp
#include <Arduino.h>

#if defined(CONFIG_IDF_TARGET_ESP32S3) or defined(CONFIG_IDF_TARGET_ESP32S2)

#include "../TFT_eSPI.h"
#include "./TFT_eSPI_ESP32_S3.h"

// Select the SPI port to use, ESP32 has 2 options
#if !defined(TFT_PARALLEL_8_BIT)
#ifdef USE_HSPI_PORT
SPIClass spi = SPIClass(HSPI);
#elif defined(USE_FSPI_PORT)
SPIClass spi = SPIClass(FSPI);
#else // use FSPI port
SPIClass &spi = SPI;
#endif
#endif

#ifdef ESP32_DMA
// DMA SPA handle
spi_device_handle_t dmaHAL;
#define DMA_CHANNEL SPI_DMA_CH_AUTO

#ifdef USE_HSPI_PORT
spi_host_device_t spi_host = SPI3_HOST;
#else // use FSPI port
spi_host_device_t spi_host = SPI2_HOST;
#endif
#endif

////////////////////////////////////////////////////////////////////////////////////////
#if defined(TFT_SDA_READ) && !defined(TFT_PARALLEL_8_BIT)
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           beginSDA - FPSI port only
** Description:             Detach MOSI and attach MISO to SDA for reads
***************************************************************************************/
void TFT_eSPI::begin_SDA_Read(void)
{
  gpio_set_direction((gpio_num_t)TFT_MOSI, GPIO_MODE_INPUT);
  pinMatrixInAttach(TFT_MOSI, FSPIQ_IN_IDX, false);
  SET_BUS_READ_MODE;
}

/***************************************************************************************
** Function name:           endSDA - FPSI port only
** Description:             Attach MOSI to SDA and detach MISO for writes
***************************************************************************************/
void TFT_eSPI::end_SDA_Read(void)
{
  gpio_set_direction((gpio_num_t)TFT_MOSI, GPIO_MODE_OUTPUT);
  pinMatrixOutAttach(TFT_MOSI, FSPID_OUT_IDX, false, false);
  SET_BUS_WRITE_MODE;
}
////////////////////////////////////////////////////////////////////////////////////////
#endif // #if defined (TFT_SDA_READ)
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           read byte  - supports class functions
** Description:             Read a byte from ESP32 8 bit data port
***************************************************************************************/
// Parallel bus MUST be set to input before calling this function!
uint8_t TFT_eSPI::readByte(void)
{
  uint8_t b = 0xAA;

#if defined(TFT_PARALLEL_8_BIT)
  RD_L;
  b = gpio_get_level((gpio_num_t)TFT_D0); // Read three times to allow for bus access time
  b = gpio_get_level((gpio_num_t)TFT_D0);
  b = gpio_get_level((gpio_num_t)TFT_D0); // Data should be stable now

  // Check GPIO bits used and build value
  b = (gpio_get_level((gpio_num_t)TFT_D0) << 0);
  b |= (gpio_get_level((gpio_num_t)TFT_D1) << 1);
  b |= (gpio_get_level((gpio_num_t)TFT_D2) << 2);
  b |= (gpio_get_level((gpio_num_t)TFT_D3) << 3);
  b |= (gpio_get_level((gpio_num_t)TFT_D4) << 4);
  b |= (gpio_get_level((gpio_num_t)TFT_D5) << 5);
  b |= (gpio_get_level((gpio_num_t)TFT_D6) << 6);
  b |= (gpio_get_level((gpio_num_t)TFT_D7) << 7);
  RD_H;
#endif

  return b;
}

////////////////////////////////////////////////////////////////////////////////////////
#ifdef TFT_PARALLEL_8_BIT
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           GPIO direction control  - supports class functions
** Description:             Set parallel bus to INPUT or OUTPUT
***************************************************************************************/
void TFT_eSPI::busDir(uint32_t mask, uint8_t mode)
{
  // Arduino generic native function
  pinMode(TFT_D0, mode);
  pinMode(TFT_D1, mode);
  pinMode(TFT_D2, mode);
  pinMode(TFT_D3, mode);
  pinMode(TFT_D4, mode);
  pinMode(TFT_D5, mode);
  pinMode(TFT_D6, mode);
  pinMode(TFT_D7, mode);
}

/***************************************************************************************
** Function name:           GPIO direction control  - supports class functions
** Description:             Set ESP32 GPIO pin to input or output (set high) ASAP
***************************************************************************************/
void TFT_eSPI::gpioMode(uint8_t gpio, uint8_t mode)
{
  pinMode(gpio, mode);
  digitalWrite(gpio, HIGH);
}
////////////////////////////////////////////////////////////////////////////////////////
#endif // #ifdef TFT_PARALLEL_8_BIT
////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////
#if defined(RPI_WRITE_STROBE) && !defined(TFT_PARALLEL_8_BIT) // Code for RPi TFT
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           pushBlock - for ESP32 or ESP8266 RPi TFT
** Description:             Write a block of pixels of the same colour
***************************************************************************************/
void TFT_eSPI::pushBlock(uint16_t color, uint32_t len)
{
  uint8_t colorBin[] = {(uint8_t)(color >> 8), (uint8_t)color};
  if (len)
    spi.writePattern(&colorBin[0], 2, 1);
  len--;
  while (len--)
  {
    WR_L;
    WR_H;
  }
}

/***************************************************************************************
** Function name:           pushPixels - for ESP32 or ESP8266 RPi TFT
** Description:             Write a sequence of pixels
***************************************************************************************/
void TFT_eSPI::pushPixels(const void *data_in, uint32_t len)
{
  uint8_t *data = (uint8_t *)data_in;

