Kolodieiev/MeowUI/lib/TFT_eSPI/Processors/TFT_eSPI_ESP32_S3.cpp
  uint16_t *data = (uint16_t *)data_in;
  while (len--)
  {
    tft_Write_16(*data);
    data++;
  }
}

/***************************************************************************************
** Function name:           pushPixels - for ESP32 and parallel display
** Description:             Write a sequence of pixels
***************************************************************************************/
void TFT_eSPI::pushPixels(const void *data_in, uint32_t len)
{

  uint16_t *data = (uint16_t *)data_in;
  if (_swapBytes)
  {
    while (len--)
    {
      tft_Write_16(*data);
      data++;
    }
  }
  else
  {
    while (len--)
    {
      tft_Write_16S(*data);
      data++;
    }
  }
}

////////////////////////////////////////////////////////////////////////////////////////
#endif // End of display interface specific functions
////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////
#if defined(ESP32_DMA) && !defined(TFT_PARALLEL_8_BIT) //       DMA FUNCTIONS
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           dmaBusy
** Description:             Check if DMA is busy
***************************************************************************************/
bool TFT_eSPI::dmaBusy(void)
{
  if (!DMA_Enabled || !spiBusyCheck)
    return false;

  spi_transaction_t *rtrans;
  esp_err_t ret;
  uint8_t checks = spiBusyCheck;
  for (int i = 0; i < checks; ++i)
  {
    ret = spi_device_get_trans_result(dmaHAL, &rtrans, 0);
    if (ret == ESP_OK)
      spiBusyCheck--;
  }

  // Serial.print("spiBusyCheck=");Serial.println(spiBusyCheck);
  if (spiBusyCheck == 0)
    return false;
  return true;
}

/***************************************************************************************
** Function name:           dmaWait
** Description:             Wait until DMA is over (blocking!)
***************************************************************************************/
void TFT_eSPI::dmaWait(void)
{
  if (!DMA_Enabled || !spiBusyCheck)
    return;
  spi_transaction_t *rtrans;
  esp_err_t ret;
  for (int i = 0; i < spiBusyCheck; ++i)
  {
    ret = spi_device_get_trans_result(dmaHAL, &rtrans, portMAX_DELAY);
    assert(ret == ESP_OK);
  }
  spiBusyCheck = 0;
}

/***************************************************************************************
** Function name:           pushPixelsDMA
** Description:             Push pixels to TFT (len must be less than 32767)
***************************************************************************************/
// This will byte swap the original image if setSwapBytes(true) was called by sketch.
void TFT_eSPI::pushPixelsDMA(uint16_t *image, uint32_t len)
{
  if ((len == 0) || (!DMA_Enabled))
    return;

  dmaWait();

  if (_swapBytes)
  {
    for (uint32_t i = 0; i < len; ++i)
      (image[i] = image[i] << 8 | image[i] >> 8);
  }

  // DMA byte count for transmit is 64Kbytes maximum, so to avoid this constraint
  // small transfers are performed using a blocking call until DMA capacity is reached.
  // User sketch can prevent blocking by managing pixel count and splitting into blocks
  // of 32768 pixels maximum. (equivalent to an area of ~320 x 100 pixels)
  while (len > 0x4000)
  { // Transfer 16 bit pixels in blocks if len*2 over 65536 bytes
    pushPixels(image, 0x400);
    len -= 0x400;
    image += 0x400; // Arbitrarily send 1K pixel blocks (2Kbytes)
  }

  esp_err_t ret;
  static spi_transaction_t trans;

  memset(&trans, 0, sizeof(spi_transaction_t));

  trans.user = (void *)1;
  trans.tx_buffer = image; // finally send the line data
  trans.length = len * 16; // Data length, in bits
  trans.flags = 0;         // SPI_TRANS_USE_TXDATA flag

  ret = spi_device_queue_trans(dmaHAL, &trans, portMAX_DELAY);
  assert(ret == ESP_OK);

  spiBusyCheck++;
}

/***************************************************************************************
** Function name:           pushImageDMA
** Description:             Push image to a window (w*h must be less than 65536)
***************************************************************************************/
// Fixed const data assumed, will NOT clip or swap bytes
void TFT_eSPI::pushImageDMA(int32_t x, int32_t y, int32_t w, int32_t h, uint16_t const *image)
{
  if ((w == 0) || (h == 0) || (!DMA_Enabled))
    return;

  uint16_t *buffer = (uint16_t *)image;
  uint32_t len = w * h;

  dmaWait();

  setAddrWindow(x, y, w, h);
  // DMA byte count for transmit is 64Kbytes maximum, so to avoid this constraint
  // small transfers are performed using a blocking call until DMA capacity is reached.
  // User sketch can prevent blocking by managing pixel count and splitting into blocks
  // of 32768 pixels maximum. (equivalent to an area of ~320 x 100 pixels)
  while (len > 0x4000)
  { // Transfer 16 bit pixels in blocks if len*2 over 65536 bytes
    pushPixels(buffer, 0x400);
    len -= 0x400;
    buffer += 0x400; // Arbitrarily send 1K pixel blocks (2Kbytes)
  }

  esp_err_t ret;
  static spi_transaction_t trans;

  memset(&trans, 0, sizeof(spi_transaction_t));

  trans.user = (void *)1;
  trans.tx_buffer = buffer; // Data pointer
  trans.length = len * 16;  // Data length, in bits
  trans.flags = 0;          // SPI_TRANS_USE_TXDATA flag

  ret = spi_device_queue_trans(dmaHAL, &trans, portMAX_DELAY);
  assert(ret == ESP_OK);

  spiBusyCheck++;
}

/***************************************************************************************
** Function name:           pushImageDMA
** Description:             Push image to a window (w*h must be less than 65536)
***************************************************************************************/
// This will clip and also swap bytes if setSwapBytes(true) was called by sketch
void TFT_eSPI::pushImageDMA(int32_t x, int32_t y, int32_t w, int32_t h, uint16_t *image, uint16_t *buffer)
{
  if ((x >= _vpW) || (y >= _vpH) || (!DMA_Enabled))
    return;

  int32_t dx = 0;
  int32_t dy = 0;
  int32_t dw = w;
  int32_t dh = h;

  if (x < _vpX)
  {
    dx = _vpX - x;
    dw -= dx;
    x = _vpX;
  }
  if (y < _vpY)
  {
    dy = _vpY - y;
    dh -= dy;
    y = _vpY;
  }

  if ((x + dw) > _vpW)
    dw = _vpW - x;
  if ((y + dh) > _vpH)
    dh = _vpH - y;

  if (dw < 1 || dh < 1)
    return;

  uint32_t len = dw * dh;

